## Melt and Pivot 
- melt() — Wide to Long
- pivot() — Long to Wide

In [1]:
import pandas as pd
# Sample DataFrame
data = {
'Name': ['Alice', 'Bob', 'Charlie'],
'Math': [85, 78, 92],
'Science': [90, 82, 89],
'English': [88, 85, 94]
}
df = pd.DataFrame(data)
# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [3]:
df #original data frame

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [2]:
df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name = "Subject", value_name ="Score")

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [4]:
# now using pivot()
melted_df = df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name = "Subject", value_name ="Score")

In [8]:
melted_df.pivot(index="Name", columns="Subject", values="Score")

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

In [11]:
melted_df.pivot(index="Name", columns='Subject', values="Score")

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

In [12]:
melted_df

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [22]:
pivoted_df = melted_df.pivot(index="Name", columns='Subject', values="Score")
print(pivoted_df)

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

In [23]:
pivoted_df.columns.name = None

In [24]:
pivoted_df

         English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89